<?php
    $news = array(
        array(
            'date' => '2019-08-01',
            'thumb' => 'assets/img/demo-news.png',
            'title' => '文章標題1',
            'description' => '文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述，文章1的簡述。',
        ),
        array(
            'date' => '2019-07-15',
            'thumb' => 'assets/img/demo-news.png',
            'title' => '文章標題2',
            'description' => '文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述，文章2的簡述。',
        ),
        array(
            'date' => '2019-06-28',
            'thumb' => 'assets/img/demo-news.png',
            'title' => '文章標題3',
            'description' => '文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述，文章3的簡述。',
        ),
    );
    $products = array(
        array(
            'image' => 'assets/img/demo-product.jpg',
            'name' => '產品名稱',
            'price' => 'NT$899',
            'special' => 'NT$998',
            'discount' => '-20%',
            'short_description' => '產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述。',
        ),
        array(
            'image' => 'assets/img/demo-product.jpg',
            'name' => '產品名稱',
            'price' => 'NT$899',
            'special' => 'NT$998',
            'discount' => '-20%',
            'short_description' => '產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述。',
        ),array(
            'image' => 'assets/img/demo-product.jpg',
            'name' => '產品名稱',
            'price' => 'NT$899',
            'special' => 'NT$998',
            'discount' => '-20%',
            'short_description' => '產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述。',
        ),
        array(
            'image' => 'assets/img/demo-product.jpg',
            'name' => '產品名稱',
            'price' => 'NT$899',
            'special' => 'NT$998',
            'discount' => '-20%',
            'short_description' => '產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述，產品簡述。',
        ),
    );
    $children = array(
        array(
            'name' => '第二層分類',
        ),
        array(
            'name' => '第二層分類',
        ),
    );
    $categories = array(
        array(
            'name' => '主分類',
            'children' => $children,
        ),
        array(
            'name' => '主分類',
            'children' => $children,
        ),
        array(
            'name' => '主分類',
            'children' => $children,
        ),
        array(
            'name' => '主分類',
            'children' => $children,
        ),
    );
    
    $timeline = array(
        array(
            'year' => '2021',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2020',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2019',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2018',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2017',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2016',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2015',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2014',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2013',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2012',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2011',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2010',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2009',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2009',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2008',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2007',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2006',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
        array(
            'year' => '2005',
            'description1' => '描述1描述1描述1描述1描述1描述1描述1描述1描述1描述1。',
            'description2' => '描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2描述2。'
        ),
    );
?>